app/views/photos/_form.html.erb

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."sneaker_id" = ?  [["sneaker_id", 1]]
SELECT "sneakers".* FROM "sneakers"
---
      <%#= f.number_field :sneaker_id %>
      <%= select("photo", "sneaker_id", Sneaker.all.collect { |s| [s.brand, s.id] }, { include_blank: true }) %>