app/views/photos/_show.html.erb

<h2><%= link_to Sneaker.find(photo.sneaker_id).name, photo %></h2>
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]