app/views/photos/show.html.erb

  <strong>Sneaker:</strong>
  <%= Sneaker.find(@photo.sneaker_id).brand %>
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]