app/controllers/brands_controller.rb

  def create
    @brand = Brand.new(brand_params)

    respond_to do |format|
      if @brand.save
---
INSERT INTO "brands" ("brand_id", "title", "created_at", "updated_at", "logo") VALUES (?, ?, ?, ?, ?)  [["brand_id", 1], ["title", "ADIDAS"], ["created_at", 2017-05-14 18:04:58 UTC], ["updated_at", 2017-05-14 18:04:58 UTC], ["logo", "Logoadidas.jpg"]]

  def update
    respond_to do |format|
      if @brand.update(brand_params)
---
UPDATE "brands" SET "updated_at" = ?, "logo" = ? WHERE "brands"."id" = ?  [["updated_at", 2017-05-14 18:20:01 UTC], ["logo", "Logodiadora.jpg"], ["id", 8]]

  def destroy
    @brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 1]]

    def set_brand
      @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]