app/controllers/photos_controller.rb

INSERT INTO "photos" ("sneaker_id", "description", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?)  [["sneaker_id", 1], ["description", ""], ["created_at", 2017-05-04 16:03:27 UTC], ["updated_at", 2017-05-04 16:03:27 UTC], ["image", "adidas_c.jpg"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "updated_at" = ?, "image" = ? WHERE "photos"."id" = ?  [["updated_at", 2017-05-04 16:10:48 UTC], ["image", "adidas_c.jpg"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)