app/controllers/sneakers_controller.rb

SELECT "sneakers".* FROM "sneakers"
---
  def index
    @sneakers = Sneaker.all

INSERT INTO "sneakers" ("name", "brand", "sex", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "NIKE LAB DUNK LUX LOW"], ["brand", "2"], ["sex", "m"], ["price", "9490"], ["created_at", 2017-05-05 10:58:23 UTC], ["updated_at", 2017-05-05 10:58:23 UTC]]
---
  def create
    @sneaker = Sneaker.new(sneaker_params)

    respond_to do |format|
      if @sneaker.save

UPDATE "sneakers" SET "name" = ?, "updated_at" = ? WHERE "sneakers"."id" = ?  [["name", "LAB DUNK LUX LOW"], ["updated_at", 2017-05-05 10:59:02 UTC], ["id", 19]]
---
  def update
    respond_to do |format|
      if @sneaker.update(sneaker_params)

DELETE FROM "sneakers" WHERE "sneakers"."id" = ?  [["id", 13]]
---
  def destroy
    @sneaker.destroy

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_sneaker
      @sneaker = Sneaker.find(params[:id])