app/views/sneakers/_form.html.erb

    <%#= f.text_field :brand %>
    <%= select("sneaker", "brand", Brand.all.collect { |b| [b.title, b.id] }, { include_blank: true }) %>
---
SELECT "brands".* FROM "brands"
SELECT "sneakers".* FROM "sneakers"